CommunityGD32Cores/platform-gd32/misc/svd/GD32E508.svd
        <register>
          <name>ST2CH1SET</name>
          <displayName>ST2CH1SET</displayName>
          <description>SHRTIMER Slave_TIMERx channel 1 set request register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH1SUP</name>
              <description>Update event generates channel 1 </description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1SEXEV9</name>
              <description>External event 9 generates channel 1 </description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1SEXEV8</name>
              <description>External event 8 generates channel 1 </description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1SEXEV7</name>
              <description>External event 7 generates channel 1 </description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1SEXEV6</name>
              <description>External event 6 generates channel 1 </description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1SEXEV5</name>
              <description>External event 5 generates channel 1 </description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1SEXEV4</name>
              <description>External event 4 generates channel 1 </description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1SEXEV3</name>
              <description>External event 3 generates channel 1 </description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1SEXEV2</name>
              <description>External event 2 generates channel 1 </description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1SEXEV1</name>
              <description>External event 1 generates channel 1 </description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1SEXEV0</name>
              <description>External event 0 generates channel 1 </description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1SSTEV8</name>
              <description>Slave_TIMERx interconnection event 8 generates channel 1 </description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1SSTEV7</name>
              <description>Slave_TIMERx interconnection event 7 generates channel 1 </description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1SSTEV6</name>
              <description>Slave_TIMERx interconnection event 6 generates channel 1 </description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1SSTEV5</name>
              <description>Slave_TIMERx interconnection event 5 generates channel 1 </description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1SSTEV4</name>
              <description>Slave_TIMERx interconnection event 4 generates channel 1 </description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1SSTEV3</name>
              <description>Slave_TIMERx interconnection event 3 generates channel 1 </description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1SSTEV2</name>
              <description>Slave_TIMERx interconnection  event 2 generates channel 1 </description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1SSTEV1</name>
              <description>Slave_TIMERx interconnection event 1 generates channel 1 </description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1SSTEV0</name>
              <description>Slave_TIMERx interconnection event 0 generates channel 1 </description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1SMTCMP3</name>
              <description>Master_TIMER compare 3 event generates channel 1 </description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1SMTCMP2</name>
              <description>Master_TIMER compare 2 event generates channel 1 </description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1SMTCMP1</name>
              <description>Master_TIMER compare 1 event generates channel 1 </description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1SMTCMP0</name>
              <description>Master_TIMER compare 0 event generates channel 1 </description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1SMTPER</name>
              <description>Master_TIMER period event generates channel 1 </description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1SCMP3</name>
              <description>Slave_TIMERx compare 3 event generates channel 1 </description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1SCMP2</name>
              <description>Slave_TIMERx compare 2 event generates channel 1 </description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1SCMP1</name>
              <description>Slave_TIMERx compare 1 event generates channel 1 </description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1SCMP0</name>
              <description>Slave_TIMERx compare 0 event generates channel 1 </description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1SPER</name>
              <description>Slave_TIMERx period event generates channel 1 </description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1SRST</name>
              <description>Slave_TIMERx reset event generates channel 1 </description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1SSEV</name>
              <description>Software event generates channel 1 </description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ST2CH1RST</name>
          <displayName>ST2CH1RST</displayName>
          <description>SHRTIMER Slave_TIMERx channel 1 reset request register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH1RSUP</name>
              <description>Update event generates channel 1 </description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1RSEXEV9</name>
              <description>External event 9 generates channel 1 </description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1RSEXEV8</name>
              <description>External event 8 generates channel 1 </description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1RSEXEV7</name>
              <description>External event 7 generates channel 1 </description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1RSEXEV6</name>
              <description>External event 6 generates channel 1 </description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1RSEXEV5</name>
              <description>External event 5 generates channel 1 </description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1RSEXEV4</name>
              <description>External event 4 generates channel 1 </description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1RSEXEV3</name>
              <description>External event 3 generates channel 1 </description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1RSEXEV2</name>
              <description>External event 2 generates channel 1 </description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1RSEXEV1</name>
              <description>External event 1 generates channel 1 </description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1RSEXEV0</name>
              <description>External event 0 generates channel 1 </description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1RSSTEV8</name>
              <description>Slave_TIMERx interconnection event 8 generates channel 1 </description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1RSSTEV7</name>
              <description>Slave_TIMERx interconnection event 7 generates channel 1 </description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1RSSTEV6</name>
              <description>Slave_TIMERx interconnection event 6 generates channel 1 </description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1RSSTEV5</name>
              <description>Slave_TIMERx interconnection event 5 generates channel 1 </description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1RSSTEV4</name>
              <description>Slave_TIMERx interconnection event 4 generates channel 1 </description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1RSSTEV3</name>
              <description>Slave_TIMERx interconnection event 3 generates channel 1 </description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1RSSTEV2</name>
              <description>Slave_TIMERx interconnection  event 2 generates channel 1 </description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1RSSTEV1</name>
              <description>Slave_TIMERx interconnection event 1 generates channel 1 </description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1RSSTEV0</name>
              <description>Slave_TIMERx interconnection event 0 generates channel 1 </description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1RSMTCMP3</name>
              <description>Master_TIMER compare 3 event generates channel 1 </description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1RSMTCMP2</name>
              <description>Master_TIMER compare 2 event generates channel 1 </description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1RSMTCMP1</name>
              <description>Master_TIMER compare 1 event generates channel 1 </description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1RSMTCMP0</name>
              <description>Master_TIMER compare 0 event generates channel 1 </description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1RSMTPER</name>
              <description>Master_TIMER period event generates channel 1 </description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1RSCMP3</name>
              <description>Slave_TIMERx compare 3 event generates channel 1 </description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1RSCMP2</name>
              <description>Slave_TIMERx compare 2 event generates channel 1 </description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1RSCMP1</name>
              <description>Slave_TIMERx compare 1 event generates channel 1 </description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1RSCMP0</name>
              <description>Slave_TIMERx compare 0 event generates channel 1 </description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1RSPER</name>
              <description>Slave_TIMERx period event generates channel 1 </description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1RSRST</name>
              <description>Slave_TIMERx reset event generates channel 1 </description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1RSSEV</name>
              <description>Software event generates channel 1 </description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ST2EXEVFCFG0</name>
          <displayName>ST2EXEVFCFG0</displayName>
          <description>SHRTIMER Slave_TIMERx external event filter configuration register 0</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXEV4FM</name>
              <description>External event 4 filter mode</description>
              <bitOffset>25</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXEV4MEEN</name>
              <description>External event 4 memorized enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXEV3FM</name>
              <description>External event 3 filter mode</description>
              <bitOffset>19</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXEV3MEEN</name>
              <description>External event 3 memorized enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXEV2FM</name>
              <description>External event 2 filter mode</description>
              <bitOffset>13</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXEV2MEEN</name>
              <description>External event 2 memorized enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXEV1FM</name>
              <description>External event 1 filter mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXEV1MEEN</name>
              <description>External event 1 memorized enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXEV0FM</name>
              <description>External event 0 filter mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXEV0MEEN</name>
              <description>External event 0 memorized enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ST2EXEVFCFG1</name>
          <displayName>ST2EXEVFCFG1</displayName>
          <description>SHRTIMER Slave_TIMERx external event filter configuration register 1</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXEV9FM</name>
              <description>External event 9 filter mode</description>
              <bitOffset>25</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXEV9MEEN</name>
              <description>External event 9 memorized enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXEV8FM</name>
              <description>External event 8 filter mode</description>
              <bitOffset>19</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXEV8MEEN</name>
              <description>External event 8 memorized enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXEV7FM</name>
              <description>External event 7 filter mode</description>
              <bitOffset>13</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXEV7MEEN</name>
              <description>External event 7 memorized enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXEV6FM</name>
              <description>External event 6 filter mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXEV6MEEN</name>
              <description>External event 6 memorized enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXEV5FM</name>
              <description>External event 5 filter mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXEV5MEEN</name>
              <description>External event 5 memorized enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
