CommunityGD32Cores/platform-gd32/misc/svd/GD32E508.svd
        <register>
          <name>ST4CMP2V</name>
          <displayName>ST4CMP2V</displayName>
          <description>SHRTIMER Slave_TIMERx compare 2 value register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CMP2VAL</name>
              <description>Compare 2 value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ST4CMP3V</name>
          <displayName>ST4CMP3V</displayName>
          <description>SHRTIMER Slave_TIMERx compare 3 value register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CMP3VAL</name>
              <description>Compare 3 value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ST4CAP0V</name>
          <displayName>ST4CAP0V</displayName>
          <description>SHRTIMER Slave_TIMERx capture 0 value register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CAP0VAL</name>
              <description>Capture 0 value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ST4CAP1V</name>
          <displayName>ST4CAP1V</displayName>
          <description>SHRTIMER Slave_TIMERx capture 1 value register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CAP1VAL</name>
              <description>Capture 1 value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ST4DTCTL</name>
          <displayName>ST4DTCTL</displayName>
          <description>SHRTIMER Slave_TIMERx dead-time control register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DTFSVPROT</name>
              <description>Dead-time falling edge protection for value and sign</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTFSPROT</name>
              <description>Dead-time falling edge protection for sign</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTFS</name>
              <description>The sign of falling edge dead-time value</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTFCFG</name>
              <description>Falling edge dead-time value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>DTRSVPROT</name>
              <description>Dead-time rising edge protection for value and sign</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTRSPROT</name>
              <description>Dead-time rising edge protection for sign</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTGCKDIV</name>
              <description>Dead time generator clock division</description>
              <bitOffset>10</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DTRS</name>
              <description>The sign of falling edge dead-time value</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTRCFG</name>
              <description>Falling edge dead-time value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ST4CH0SET</name>
          <displayName>ST4CH0SET</displayName>
          <description>SHRTIMER Slave_TIMERx channel 0 set request register</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH0SUP</name>
              <description>Update event generates channel 0 </description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0SEXEV9</name>
              <description>External event 9 generates channel 0 </description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0SEXEV8</name>
              <description>External event 8 generates channel 0 </description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0SEXEV7</name>
              <description>External event 7 generates channel 0 </description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0SEXEV6</name>
              <description>External event 6 generates channel 0 </description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0SEXEV5</name>
              <description>External event 5 generates channel 0 </description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0SEXEV4</name>
              <description>External event 4 generates channel 0 </description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0SEXEV3</name>
              <description>External event 3 generates channel 0 </description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0SEXEV2</name>
              <description>External event 2 generates channel 0 </description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0SEXEV1</name>
              <description>External event 1 generates channel 0 </description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0SEXEV0</name>
              <description>External event 0 generates channel 0 </description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0SSTEV8</name>
              <description>Slave_TIMERx interconnection event 8 generates channel 0 </description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0SSTEV7</name>
              <description>Slave_TIMER1 interconnection event 7 generates channel 0 </description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0SSTEV6</name>
              <description>Slave_TIMERx interconnection event 6 generates channel 0 </description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0SSTEV5</name>
              <description>Slave_TIMERx interconnection event 5 generates channel 0 </description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0SSTEV4</name>
              <description>Slave_TIMERx interconnection event 4 generates channel 0 </description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0SSTEV3</name>
              <description>Slave_TIMERx interconnection event 3 generates channel 0 </description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0SSTEV2</name>
              <description>Slave_TIMERx interconnection  event 2 generates channel 0 </description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0SSTEV1</name>
              <description>Slave_TIMERx interconnection event 1 generates channel 0 </description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0SSTEV0</name>
              <description>Slave_TIMERx interconnection event 0 generates channel 0 </description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0SMTCMP3</name>
              <description>Master_TIMER compare 3 event generates channel 0 </description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0SMTCMP2</name>
              <description>Master_TIMER compare 2 event generates channel 0 </description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0SMTCMP1</name>
              <description>Master_TIMER compare 1 event generates channel 0 </description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0SMTCMP0</name>
              <description>Master_TIMER compare 0 event generates channel 0 </description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0SMTPER</name>
              <description>Master_TIMER period event generates channel 0 </description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0SCMP3</name>
              <description>Slave_TIMERx compare 3 event generates channel 0 </description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0SCMP2</name>
              <description>Slave_TIMERx compare 2 event generates channel 0 </description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0SCMP1</name>
              <description>Slave_TIMERx compare 1 event generates channel 0 </description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0SCMP0</name>
              <description>Slave_TIMERx compare 0 event generates channel 0 </description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0SPER</name>
              <description>Slave_TIMERx period event generates channel 0 </description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0SRST</name>
              <description>Slave_TIMERx reset event generates channel 0 </description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0SSEV</name>
              <description>Software event generates channel 0 </description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ST4CH0RST</name>
          <displayName>ST4CH0RST</displayName>
          <description>SHRTIMER Slave_TIMERx channel 0 reset request register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH0RSUP</name>
              <description>Update event generates channel 0 </description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0RSEXEV9</name>
              <description>External event 9 generates channel 0 </description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0RSEXEV8</name>
              <description>External event 8 generates channel 0 </description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0RSEXEV7</name>
              <description>External event 7 generates channel 0 </description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0RSEXEV6</name>
              <description>External event 6 generates channel 0 </description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0RSEXEV5</name>
              <description>External event 5 generates channel 0 </description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0RSEXEV4</name>
              <description>External event 4 generates channel 0 </description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0RSEXEV3</name>
              <description>External event 3 generates channel 0 </description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0RSEXEV2</name>
              <description>External event 2 generates channel 0 </description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0RSEXEV1</name>
              <description>External event 1 generates channel 0 </description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0RSEXEV0</name>
              <description>External event 0 generates channel 0 </description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0RSSTEV8</name>
              <description>Slave_TIMERx interconnection event 8 generates channel 0 </description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0RSSTEV7</name>
              <description>Slave_TIMERx interconnection event 7 generates channel 0 </description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0RSSTEV6</name>
              <description>Slave_TIMERx interconnection event 6 generates channel 0 </description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0RSSTEV5</name>
              <description>Slave_TIMERx interconnection event 5 generates channel 0 </description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0RSSTEV4</name>
              <description>Slave_TIMER1 interconnection event 4 generates channel 0 </description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0RSSTEV3</name>
              <description>Slave_TIMERx interconnection event 3 generates channel 0 </description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0RSSTEV2</name>
              <description>Slave_TIMERx interconnection  event 2 generates channel 0 </description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0RSSTEV1</name>
              <description>Slave_TIMERx interconnection event 1 generates channel 0 </description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0RSSTEV0</name>
              <description>Slave_TIMER1 interconnection event 0 generates channel 0 </description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0RSMTCMP3</name>
              <description>Master_TIMER compare 3 event generates channel 0 </description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0RSMTCMP2</name>
              <description>Master_TIMER compare 2 event generates channel 0 </description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0RSMTCMP1</name>
              <description>Master_TIMER compare 1 event generates channel 0 </description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0RSMTCMP0</name>
              <description>Master_TIMER compare 0 event generates channel 0 </description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0RSMTPER</name>
              <description>Master_TIMER period event generates channel 0 </description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0RSCMP3</name>
              <description>Slave_TIMERx compare 3 event generates channel 0 </description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0RSCMP2</name>
              <description>Slave_TIMER1 compare 2 event generates channel 0 </description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0RSCMP1</name>
              <description>Slave_TIMERx compare 1 event generates channel 0 </description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0RSCMP0</name>
              <description>Slave_TIMERx compare 0 event generates channel 0 </description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0RSPER</name>
              <description>Slave_TIMERx period event generates channel 0 </description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0RSRST</name>
              <description>Slave_TIMERx reset event generates channel 0 </description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0RSSEV</name>
              <description>Software event generates channel 0 </description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
