CommunityGD32Cores/platform-gd32/misc/svd/GD32E508.svd
        <register>
          <name>BMSTRG</name>
          <displayName>BMSTRG</displayName>
          <description>SHRTIMER bunch mode start trigger register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CISGN</name>
              <description>Chip internal signal triggers bunch mode operation</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXEV7</name>
              <description>External event 7 triggers bunch mode operation</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXEV6</name>
              <description>External event 6 triggers bunch mode operation</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST3EXEV7</name>
              <description>Slave_TIMER3 period event following external event 7 triggers bunch mode operation</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST0EXEV6</name>
              <description>Slave_TIMER0 period event following external event 6 triggers bunch mode operation</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST4CMP1</name>
              <description>Slave_TIMER4 compare 1 event triggers bunch mode operation</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST4CMP0</name>
              <description>Slave_TIMER4 compare 0 event triggers bunch mode operation</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST4REP</name>
              <description>Slave_TIMER4 repetition event triggers bunch mode operation</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST4RST</name>
              <description>Slave_TIMER4 reset event triggers bunch mode operation</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST3CMP1</name>
              <description>Slave_TIMER3 compare 1 event triggers bunch mode operation</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST3CMP0</name>
              <description>Slave_TIMER3 compare 0 event triggers bunch mode operation</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST3REP</name>
              <description>Slave_TIMER3 repetition event triggers bunch mode operation</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST3RST</name>
              <description>Slave_TIMER3 reset event triggers bunch mode operation</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST2CMP1</name>
              <description>Slave_TIMER2 compare 1 event triggers bunch mode operation</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST2CMP0</name>
              <description>Slave_TIMER2 compare 0 event triggers bunch mode operation</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST2REP</name>
              <description>Slave_TIMER1 repetition event triggers bunch mode operation</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST2RST</name>
              <description>Slave_TIMER2 reset event triggers bunch mode operation</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST1CMP1</name>
              <description>Slave_TIMER1 compare 1 event triggers bunch mode operation</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST1CMP0</name>
              <description>Slave_TIMER1 compare 0 event triggers bunch mode operation</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST1REP</name>
              <description>Slave_TIMER1 repetition event triggers bunch mode operation</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST1RST</name>
              <description>Slave_TIMER1 reset event triggers bunch mode operation</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST0CMP1</name>
              <description>Slave_TIMER0 compare 1 event triggers bunch mode operation</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST0CMP0</name>
              <description>Slave_TIMER0 compare 0 event triggers bunch mode operation</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST0REP</name>
              <description>Slave_TIMER0 repetition event triggers bunch mode operation</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST0RST</name>
              <description>Slave_TIMER0 reset event triggers bunch mode operation</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MTCMP3</name>
              <description>Master_TIMER compare 3 event triggers bunch mode operation</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MTCMP2</name>
              <description>Master_TIMER compare 2 event triggers bunch mode operation</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MTCMP1</name>
              <description>Master_TIMER compare 1 event triggers bunch mode operation</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MTCMP0</name>
              <description>Master_TIMER compare 0 event triggers bunch mode operation</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MTREP</name>
              <description>Master_TIMER repetition event triggers bunch mode operation</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MTRST</name>
              <description>Master_TIMER reset event triggers bunch mode operation</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWTRG</name>
              <description>Software triggers bunch mode operation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>

        <register>
          <name>BMCMPV</name>
          <displayName>BMCMPV</displayName>
          <description>SHRTIMER bunch mode compare value register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BMCMPVAL</name>
              <description>Bunch mode compare value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>

        <register>
          <name>BMCAR</name>
          <displayName>BMCAR</displayName>
          <description>SHRTIMER bunch mode counter auto reload register </description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BMCARL</name>
              <description>Bunch mode counter auto reload value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>

        <register>
          <name>EXEVCFG0</name>
          <displayName>EXEVCFG0</displayName>
          <description>SHRTIMER external event configuration register 0 </description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXEV4EG</name>
              <description>External event 4 edge sensitivity</description>
              <bitOffset>27</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXEV4P</name>
              <description>External event 4 polarity</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXEV4SRC</name>
              <description>External event 4 source</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXEV3EG</name>
              <description>External event 3 edge sensitivity</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXEV3P</name>
              <description>External event 3 polarity</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXEV3SRC</name>
              <description>External event 3 source</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXEV2EG</name>
              <description>External event 2 edge sensitivity</description>
              <bitOffset>15</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXEV2P</name>
              <description>External event 2 polarity</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXEV2SRC</name>
              <description>External event 2 source</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXEV1EG</name>
              <description>External event 1 edge sensitivity</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXEV1P</name>
              <description>External event 1 polarity</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXEV1SRC</name>
              <description>External event 1 source</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXEV0EG</name>
              <description>External event 0 edge sensitivity</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXEV0P</name>
              <description>External event 0 polarity</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXEV0SRC</name>
              <description>External event 0 source</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>

        <register>
          <name>EXEVCFG1</name>
          <displayName>EXEVCFG1</displayName>
          <description>SHRTIMER external event configuration register 1 </description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXEV9EG</name>
              <description>External event 9 edge sensitivity</description>
              <bitOffset>27</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXEV9P</name>
              <description>External event 9 polarity</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXEV9SRC</name>
              <description>External event 9 source</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXEV8EG</name>
              <description>External event 8 edge sensitivity</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXEV8P</name>
              <description>External event 8 polarity</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXEV8SRC</name>
              <description>External event 8 source</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXEV7EG</name>
              <description>External event 7 edge sensitivity</description>
              <bitOffset>15</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXEV7P</name>
              <description>External event 7polarity</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXEV7SRC</name>
              <description>External event 7 source</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXEV6EG</name>
              <description>External event 6 edge sensitivity</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXEV6P</name>
              <description>External event 1 polarity</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXEV6SRC</name>
              <description>External event 1 source</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXEV5EG</name>
              <description>External event 0 edge sensitivity</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXEV5P</name>
              <description>External event 0 polarity</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXEV5SRC</name>
              <description>External event 0 source</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>

        <register>
          <name>EXEVDFCTL</name>
          <displayName>EXEVDFCTL</displayName>
          <description>SHRTIMER external event digital filter control register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXEVFDIV</name>
              <description>External event digital filter clock division</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXEV9FC</name>
              <description>External event 9 filter control</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXEV8FC</name>
              <description>External event 8 filter control</description>
              <bitOffset>18</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXEV7FC</name>
              <description>External event 7 filter control</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXEV6FC</name>
              <description>External event 6 filter control</description>
              <bitOffset>6</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXEV5FC</name>
              <description>External event 5 filter control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>

